# Introduction to Pandas

**pandas** is a Python package providing fast, flexible, and expressive data structures designed to work with *relational* or *labeled* data both. It is a fundamental high-level building block for executing practical, real world data analysis in Python. 

pandas is well suited for:

- Tabular data with heterogeneously-typed columns, as in an SQL table or Excel spreadsheet
- Ordered and unordered (not necessarily fixed-frequency) time series data.
- Arbitrary matrix data (homogeneously typed or heterogeneous) with row and column labels
- Any other form of observational / statistical data sets. The data actually need not be labeled at all to be placed into a pandas data structure


Key features:
    
- Easy handling of **missing data**
- **Size mutability**: columns can be inserted and deleted from DataFrame and higher dimensional objects
- Automatic and explicit **data alignment**: objects can be explicitly aligned to a set of labels, or the data can be aligned automatically
- Powerful, flexible **group by functionality** to perform split-apply-combine operations on data sets
- Intelligent label-based **slicing, fancy indexing, and subsetting** of large data sets
- Intuitive **merging and joining** data sets
- Flexible **reshaping and pivoting** of data sets
- **Hierarchical labeling** of axes
- Robust **IO tools** for loading data from flat files, Excel files, databases, and HDF5
- **Time series functionality**: date range generation and frequency conversion, moving window statistics, moving window linear regressions, date shifting and lagging, etc.

## Installing and Using Pandas

Installation of Pandas on your system requires NumPy to be installed, and if building the library from source, requires the appropriate tools to compile the C and Cython sources on which Pandas is built.
Details on this installation can be found in the [Pandas documentation](http://pandas.pydata.org/).

Once Pandas is installed, you can import it and check the version:

In [52]:
import pandas
pandas.__version__

'1.4.2'

# Introducing Pandas Objects

At the very basic level, Pandas objects can be thought as enhanced versions of NumPy structured arrays in which the rows and columns are identified with labels rather than simple integer indices.
As we will see during the course of this chapter, Pandas provide a host of useful tools, methods, and functionality on top of the basic data structures, but nearly everything that follows will require an understanding of what these structures are.
Thus, before we go any further, let's introduce these three fundamental Pandas data structures: the ``Series``, ``DataFrame``, and ``Index``.

We will start our code sessions with the standard NumPy and Pandas imports:

In [53]:
import numpy as np
import pandas as pd

### Series

A **Series** is a single vector of data (like a NumPy array) with an *index* that labels each element in the vector.

In [54]:
num = pd.Series([552, 143, 1097,2567])
num

0     552
1     143
2    1097
3    2567
dtype: int64

If an index is not specified, a default sequence of integers is assigned as the index. A NumPy array comprises the values of the `Series`, while the index is a pandas `Index` object.

In [55]:
num.values

array([ 552,  143, 1097, 2567], dtype=int64)

In [56]:
num.index

RangeIndex(start=0, stop=4, step=1)

We can assign meaningful labels to the index, if they are available:

In [57]:
flowers = pd.Series([552, 143, 1097, 2567],
                   index = ['Rose', 'Marigold', 'Sunflower', 'Jasmine'])
flowers

Rose          552
Marigold      143
Sunflower    1097
Jasmine      2567
dtype: int64

These labels can be used to refer to the values in the `Series`.

In [58]:
flowers['Marigold']

143

Notice that the indexing operation preserve the association between the values and the corresponding indices.

We can still use positional indexing if we wish.

In [59]:
flowers[2]

1097

We can give both the array of values and the index meaningful labels themselves:

In [60]:
flowers.name = 'num'
flowers.index.name = 'spermatophytes'
flowers

spermatophytes
Rose          552
Marigold      143
Sunflower    1097
Jasmine      2567
Name: num, dtype: int64

NumPy's math functions and other operations can be applied to Series without losing the data structure.

In [61]:
np.log(flowers)

spermatophytes
Rose         6.313548
Marigold     4.962845
Sunflower    7.000334
Jasmine      7.850493
Name: num, dtype: float64

We can also filter according to the values in the `Series`:

In [62]:
flowers[flowers>1000]

spermatophytes
Sunflower    1097
Jasmine      2567
Name: num, dtype: int64

A `Series` can be thought of as an ordered key-value store. In fact, we can create one from a `dict`:

In [63]:
flowers_dict = {'Rose': 552, 'Marigold': 143, 'Sunflower': 1097, 'Jasmine': 2567}
print(flowers_dict)
pd.Series(flowers_dict)

{'Rose': 552, 'Marigold': 143, 'Sunflower': 1097, 'Jasmine': 2567}

Rose          552
Marigold      143
Sunflower    1097
Jasmine      2567
dtype: int64

### ``Series`` as generalized NumPy array

From what we've seen so far, it may look like the ``Series`` object is basically interchangeable with a one-dimensional NumPy array.
The essential difference is the presence of the index: while the Numpy Array has an *implicitly defined* integer index used to access the values, the Pandas ``Series`` has an *explicitly defined* index associated with the values.

This explicit index definition gives the ``Series`` object additional capabilities.

### Series as specialized dictionary

In this way, you can think of a Pandas ``Series`` a bit like a specialization of  Python dictionary.
A dictionary is a structure that maps arbitrary keys to set of arbitrary values, and ``Series`` is a structure which maps typed keys to a set of typed values.
This typing is important: just as the type-specific compiled code behind a NumPy array makes it more efficient than Python list for certain operations, the type information of a Pandas ``Series`` makes it much more efficient than Python dictionaries for certain operations.

The ``Series``-as-dictionary analogy can be made even more clear by constructing a ``Series`` object directly from Python dictionary:

## DataFrame: bi-dimensional Series with two (or more) indices

A DataFrame represents a tabular, spreadsheet-like data structure containing an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc.). 

The DataFrame has both row and column index; it can be thought of as a dict of Series (all sharing the same index).

DataFrame's can be created in different ways. One of them is from dict's.

In [64]:
given = {"Names" : ["lav", "manu", "sanju", "asha"],
        "Year" : [2013, 2002, 2012, 2010],
        "Age" : [12, 20, 15, 18]}
print(given)
given = pd.DataFrame(given)
given

{'Names': ['lav', 'manu', 'sanju', 'asha'], 'Year': [2013, 2002, 2012, 2010], 'Age': [12, 20, 15, 18]}

   Names  Year  Age
0    lav  2013   12
1   manu  2002   20
2  sanju  2012   15
3   asha  2010   18

To change the order of the columns:

In [26]:
ab = pd.DataFrame(given, columns = ["Year", "Names", "Age"])
ab

   Year  Names  Age
0  2013    lav   12
1  2002   manu   20
2  2012  sanju   15
3  2010   asha   18

An `index` can be passed (as with Series), and passing column names not existing, will result in missing data.

Assigning values to new columns is easy

In [27]:
ab['Marks'] = ab.Year / ab.Age
ab

   Year  Names  Age       Marks
0  2013    lav   12  167.750000
1  2002   manu   20  100.100000
2  2012  sanju   15  134.133333
3  2010   asha   18  111.666667

In [28]:
ab['Average'] = pd.Series(range(4),index = [0,1,2,3])
ab

   Year  Names  Age       Marks  Average
0  2013    lav   12  167.750000        0
1  2002   manu   20  100.100000        1
2  2012  sanju   15  134.133333        2
3  2010   asha   18  111.666667        3

Passing a dicts where the values are dicts is also possible

In [29]:
ab.to_dict()

{'Year': {0: 2013, 1: 2002, 2: 2012, 3: 2010},
 'Names': {0: 'lav', 1: 'manu', 2: 'sanju', 3: 'asha'},
 'Age': {0: 12, 1: 20, 2: 15, 3: 18},
 'Marks': {0: 167.75, 1: 100.1, 2: 134.13333333333333, 3: 111.66666666666667},
 'Average': {0: 0, 1: 1, 2: 2, 3: 3}}

In [30]:
pd.DataFrame(ab.to_dict())

   Year  Names  Age       Marks  Average
0  2013    lav   12  167.750000        0
1  2002   manu   20  100.100000        1
2  2012  sanju   15  134.133333        2
3  2010   asha   18  111.666667        3

### DataFrame as specialized dictionary

Similarly, we can also think of a ``DataFrame`` as a specialization of dictionary.
Where a dictionary maps a key to a value, a ``DataFrame`` maps a column name to a ``Series`` of column data.
For example, asking for the ``'area'`` attribute returns the ``Series`` object containing the areas we saw earlier:

#### From a list of dicts

Any list of dictionaries can be made into a ``DataFrame``.
We'll use a simple list comprehension to create some data:

In [ ]:
data = [{'p' : a, 'q' : 10*a} for a in range(7)]
print(data)
pd.DataFrame(data)

Even if some keys in the dictionary are missing, Pandas will fill them in with ``NaN`` (i.e., "not a number") values:

In [ ]:
pd.DataFrame([{'l' : 1, 'm' : 3},{'m' : 4, 'n' : 6, 'l' : 9}])

#### From a two-dimensional NumPy array

Given a two-dimensional array of data, we can create a ``DataFrame`` with any specified column and index names.
If omitted, an integer index will be used for each:

In [ ]:
pd.DataFrame(np.random.randint(1,6),
             columns = ['good', 'bad'],
             index = ['we','to','so','if'])

## The Pandas Index Object

We have seen here that both the ``Series`` and ``DataFrame`` objects contain an explicit *index* that lets you take reference and modify data.
This ``Index`` object is an interesting structure in itself, and it can be thought of either as an *immutable array* or as an *ordered set* (technically a multi-set, as ``Index`` objects may contain repeated values).
Those views have some interesting consequences in the operations available on ``Index`` objects.
As a simple example, let's construct an ``Index`` from a list of integers:

In [7]:
ind = pd.Index([15, 20, 23, 31, 52, 61])
ind

Int64Index([15, 20, 23, 31, 52, 61], dtype='int64')

### Index as immutable array

The ``Index`` in many ways operates like an array.
For example, we can use standard Python indexing notation to retrieve values or slices:

In [8]:
ind[1]

20

In [9]:
ind[::]

Int64Index([15, 20, 23, 31, 52, 61], dtype='int64')

``Index`` objects also have many of the attributes familiar from NumPy arrays:

In [10]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

6 (6,) 1 int64

One difference between ``Index`` objects and NumPy arrays is that indices are immutable–that is, they cannot be modified via normal means:

In [11]:
ind[1] = 0

TypeError: Index does not support mutable operations

This immutability makes it safer to share indices between multiple ``DataFrame``s and arrays, without the potential for side effects from inadvertent index modification.

# Operating on Data in Pandas

One of the essential pieces of NumPy is the ability to perform quick element-wise operations, both with basic arithmetic (addition, subtraction, multiplication, etc.) and with more sophisticated operations (trigonometric functions, exponential and logarithmic functions, etc.).
Pandas inherits much of this functionality from NumPy, and the ufuncs are key to this.

Pandas includes a couple useful twists, however: for unary operations like negation and trigonometric functions, these ufuncs will *preserve index and column labels* in the output, and for binary operations such as addition and multiplication, Pandas will automatically *align indices* when passing the objects to the ufunc.
This means that keeping the context of data and combining data from different sources–both potentially error-prone tasks with raw NumPy arrays–become essentially foolproof with Pandas.
We will additionally see the well-defined operations between one-dimensional ``Series`` structures and two-dimensional ``DataFrame`` structures.

## Ufuncs: Index Preservation

Because Pandas is designed to work with NumPy, any NumPy ufunc will work on Pandas ``Series`` and ``DataFrame`` objects.
Let's start by defining a simple ``Series`` and ``DataFrame`` on which to demonstrate this:

In [14]:
import numpy as np
rng = np.random.RandomState(10)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    9
1    4
2    0
3    1
dtype: int32

In [15]:
dfr = pd.DataFrame(rng.randint(0, 10, (5, 4)),
                  columns = ['a', 'b', 'c', 'd'])
dfr

   a  b  c  d
0  9  0  1  8
1  9  0  8  6
2  4  3  0  4
3  6  8  1  8
4  4  1  3  6

If we apply a NumPy ufunc on either of these objects, the result will be another Pandas object *with the indices preserved:*

In [16]:
np.exp(ser)

0    8103.083928
1      54.598150
2       1.000000
3       2.718282
dtype: float64

Or, for a slightly more complex calculation:

In [17]:
np.sin(dfr*np.pi/4)

              a             b             c             d
0  7.071068e-01  0.000000e+00  7.071068e-01 -2.449294e-16
1  7.071068e-01  0.000000e+00 -2.449294e-16 -1.000000e+00
2  1.224647e-16  7.071068e-01  0.000000e+00  1.224647e-16
3 -1.000000e+00 -2.449294e-16  7.071068e-01 -2.449294e-16
4  1.224647e-16  7.071068e-01  7.071068e-01 -1.000000e+00

## Universal Functions: Index Alignment

For binary operations on two ``Series`` or ``DataFrame`` objects, Pandas will align indices in the process of performing the operation.
This is very convenient when working with incomplete data, as we'll see in some of the examples that follow.

### Index alignment in Series

As an example, suppose we are combining two different data sources, and find only the top three US states by *area* and the top three US states by *population*:

In [18]:
area = pd.Series({'kolar' : 567883, 'banglore' : 890456, 'mumbai' : 6790909}, name = 'area')
population = pd.Series({'banglore' : 897540, 'kolar' : 985467, 'mumbai' : 5673892}, name = 'population')
print(area)
population

kolar        567883
banglore     890456
mumbai      6790909
Name: area, dtype: int64

banglore     897540
kolar        985467
mumbai      5673892
Name: population, dtype: int64

Let's see what happens when we divide these to compute the population density:

In [19]:
population/area

banglore    1.007955
kolar       1.735335
mumbai      0.835513
dtype: float64

The resulting array contains the *union* of indices of the two input arrays, which could be determined using standard Python set arithmetic on these indices:

In [20]:
area.index | population.index

C:\Users\91831\AppData\Local\Temp\ipykernel_7704\3572280633.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  area.index | population.index

Index(['banglore', 'kolar', 'mumbai'], dtype='object')

In [21]:
A = pd.Series([1, 3, 5], index = [0, 2, 4])
B = pd.Series([3, 6, 8], index = [8, 3, 9])
print(A)
print(B)
B
A + B

0    1
2    3
4    5
dtype: int64
8    3
3    6
9    8
dtype: int64

0   NaN
2   NaN
3   NaN
4   NaN
8   NaN
9   NaN
dtype: float64

If using NaN values is not the desired behavior, the fill value can be modified using appropriate object methods in place of the operators.
For example, calling ``A.add(B)`` is equivalent to calling ``A + B``, but allows optional explicit specification of the fill value for any elements in ``A`` or ``B`` that might be missing:

In [22]:
A.add(B, fill_value = 0)

0    1.0
2    3.0
3    6.0
4    5.0
8    3.0
9    8.0
dtype: float64

The following table lists Python operators and their equivalent Pandas object methods:

| Python Operator | Pandas Method(s)                      |
|-----------------|---------------------------------------|
| ``+``           | ``add()``                             |
| ``-``           | ``sub()``, ``subtract()``             |
| ``*``           | ``mul()``, ``multiply()``             |
| ``/``           | ``truediv()``, ``div()``, ``divide()``|
| ``//``          | ``floordiv()``                        |
| ``%``           | ``mod()``                             |
| ``**``          | ``pow()``                             |

## Ufuncs: Operations Between DataFrame and Series

When performing operations between a ``DataFrame`` and a ``Series``, the index and column alignment is similarly maintained.
Operations between a ``DataFrame`` and a ``Series`` are similar to operations between two-dimensional and one-dimensional NumPy array.
Consider one common operation, where we find the difference of a two-dimensional array and one of its rows:

# Data wrangling
Getting the data in the shape that we want is the single most time consuming task in the life of the Data Scientist. Sometimes it can be the most frustrating.

## Merge operations
By merging we mean combining different data sets by linking rows with one or more keys. The basic syntax is very simple.

In [31]:
ab

   Year  Names  Age       Marks  Average
0  2013    lav   12  167.750000        0
1  2002   manu   20  100.100000        1
2  2012  sanju   15  134.133333        2
3  2010   asha   18  111.666667        3

In [32]:
ab2 = pd.DataFrame({"Names" : ["lav", "manu", "sanju", "asha"], "Population" : ["10000", "40000", "500000", "600000"]})
ab2

   Names Population
0    lav      10000
1   manu      40000
2  sanju     500000
3   asha     600000

Let's say we want a dataset with year, literacy, province and population. We can create it from `df` and `df2`.

In [33]:
 ab.merge(ab2) # merge is smart! If there are overlapping names, it uses those for the merge

   Year  Names  Age       Marks  Average Population
0  2013    lav   12  167.750000        0      10000
1  2002   manu   20  100.100000        1      40000
2  2012  sanju   15  134.133333        2     500000
3  2010   asha   18  111.666667        3     600000

If the column names are different, you need to specify them explicitely

In [38]:
ab3 = pd.DataFrame({"Names" : ["lav", "manu", "sanju", "asha"], "Population" : ["10000", "40000", "500000", "600000"]})
ab3

   Names Population
0    lav      10000
1   manu      40000
2  sanju     500000
3   asha     600000

What happened? Zuid Holland is weg!

By default `merge` does inner joins. If you want a different type of join, you can specify it.

In [39]:
ab4 = pd.DataFrame({"Names" : ["lav", "manu", "sanju", "asha","chiini"], "Population" : ["10000", "40000", "500000", "600000", "20000"]})
ab.merge(ab4, how='outer')

     Year   Names   Age       Marks  Average Population
0  2013.0     lav  12.0  167.750000      0.0      10000
1  2002.0    manu  20.0  100.100000      1.0      40000
2  2012.0   sanju  15.0  134.133333      2.0     500000
3  2010.0    asha  18.0  111.666667      3.0     600000
4     NaN  chiini   NaN         NaN      NaN      20000

Check this out:

In [41]:
ab5= pd.DataFrame({"Names" : ["lav", "manu", "sanju", "asha","chiini"], "Population" : ["10000", "40000", "500000", "600000", "20000"]})
print(ab)
ab.merge(ab5, how='outer')

    Names Population
0     lav      10000
1    manu      40000
2   sanju     500000
3    asha     600000
4  chiini      20000

    Names Population
0     lav      10000
1    manu      40000
2   sanju     500000
3    asha     600000
4  chiini      20000

This was a many-to-many merge. Even though if you think about it, the behavior is what you expect, you might still not think about it and be surprised!

### Combining data with overlap
Sometimes some data is missing, and it can be "patched" with another dataset. Let's take a look.

In [47]:
serie_a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
                   index=['a', 'l', 'm', 'n', 'p', 'b'])
serie_b = pd.Series(np.arange(len(serie_a), dtype=np.float64),
                   index=['a', 'l', 'm', 'n', 'p', 'b'])

In [48]:
serie_a

a    NaN
l    2.5
m    NaN
n    3.5
p    4.5
b    NaN
dtype: float64

In [49]:
serie_b

a    0.0
l    1.0
m    2.0
n    3.0
p    4.0
b    5.0
dtype: float64

Let's say we want to update `a` with the values from `b`. The num-pythonic way to do that is

In [50]:
pd.Series(np.where(pd.isnull(serie_a), serie_b, serie_a), index=serie_a.index)

a    0.0
l    2.5
m    2.0
n    3.5
p    4.5
b    5.0
dtype: float64

That's a bit verbose for something so simple. What about this:

In [51]:
serie_a.combine_first(serie_b)

a    0.0
l    2.5
m    2.0
n    3.5
p    4.5
b    5.0
dtype: float64